MagnusErler/WiFiLocationTracker/stm32/geolocation/main_geolocation/main_geolocation.c
    accelerometer_init( );

    // Init the modem and use modem_event_callback as event callback, please note that the callback will be
    // called immediately after the first call to smtc_modem_run_engine because of the reset detection
    smtc_modem_init( &modem_event_callback );

    // Re-enable IRQ
    hal_mcu_enable_irq( );

    SMTC_HAL_TRACE_PRINTF("\r\n\r\n-----------------------------\r\n\r\n" );
    SMTC_HAL_TRACE_INFO( "GEOLOCATION is starting\r\n" );

    ral_lr11xx_init( NULL );

    /* Check LR11XX Firmware version */
    if( lr11xx_system_get_version( NULL, &lr11xx_fw_version ) != LR11XX_STATUS_OK ) {
        SMTC_HAL_TRACE_ERROR( "Failed to get LR11XX firmware version\r\n" );
    }
    if( ( lr11xx_fw_version.type == LR11XX_SYSTEM_VERSION_TYPE_LR1110 ) && ( lr11xx_fw_version.fw < LR1110_FW_VERSION ) ) {
        SMTC_HAL_TRACE_ERROR( "Wrong LR1110 firmware version, expected 0x%04X, got 0x%04X\r\n", LR1110_FW_VERSION, lr11xx_fw_version.fw );
    }
    SMTC_HAL_TRACE_INFO( "LR11XX FW: 0x%04X, type: 0x%02X\r\n", lr11xx_fw_version.fw, lr11xx_fw_version.type );
    SMTC_HAL_TRACE_INFO( "LR11XX HW: 0x%02X\r\n", lr11xx_fw_version.hw );

    lr11xx_gnss_solver_assistance_position_t position;
    position.latitude = ( float ) 55.782788;
    position.longitude = ( float ) 12.515301;

    lr11xx_gnss_set_assistance_position( NULL, &position );

    smtc_board_hall_effect_enable( true );


    hal_gpio_init_out( DEBUG_PIN, 0 );

    while( 1 ) {

        // uint16_t temp_10_0;
        // lr11xx_system_get_temp( NULL, &temp_10_0 );
        // const float temperature = 25 + (1000/(-1.7)) * ((temp_10_0/2047.0) * 1.35 - 0.7295);
        // SMTC_HAL_TRACE_INFO("%d.%d °C\r\n", (uint8_t)temperature, (uint8_t)((temperature - (uint8_t)temperature) * 100));
        // if ((uint8_t)temperature > 50) {
        //     SMTC_HAL_TRACE_INFO("LR1110 temperature is too high. TCXO mode may not be set up correctly\r\n");
        // }

        // uint8_t vbat;
        // lr11xx_system_get_vbat( NULL, &vbat );
        // const float batteryVoltage = (((5 * vbat)/255.0) - 1) * 1.35;
        // SMTC_HAL_TRACE_INFO("%d.%d V\r\n", (uint8_t)batteryVoltage, (uint8_t)((batteryVoltage - (uint8_t)batteryVoltage) * 100));

        // SMTC_HAL_TRACE_INFO("LIS2DE12 Temperature: %d\r\n", acc_get_temperature( ));
        // acc_read_raw_data( );
        // SMTC_HAL_TRACE_INFO("X: %d, Y: %d, Z: %d\r\n", acc_get_raw_x( ), acc_get_raw_y( ), acc_get_raw_z( ));

        // if (get_accelerometer_irq1_state( ) == 1) {
        //     SMTC_HAL_TRACE_INFO("LIS2DE12 interrupt 1 detected\r\n");
        //     is_accelerometer_detected_moved( );

        //     lis2de12_int1_src_t int1_src = { 0 };
        //     if (lis2de12_int1_gen_source_get( &int1_src ) != 0 ) {
        //         SMTC_HAL_TRACE_ERROR("LIS2DE12 INT1_SRC: Error reading INT1_SRC register\r\n");
        //     } else {
        //         if (int1_src.ia == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: One or more interrupts have been generated\r\n");
        //         }
        //         if (int1_src.xl == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: X low event has occurred\r\n");
        //         }
        //         if (int1_src.xh == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: X high event has occurred\r\n");
        //         }
        //         if (int1_src.yl == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: Y low event has occurred\r\n");
        //         }
        //         if (int1_src.yh == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: Y high event has occurred\r\n");
        //         }
        //         if (int1_src.zl == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: Z low event has occurred\r\n");
        //         }
        //         if (int1_src.zh == 1) {
        //             SMTC_HAL_TRACE_INFO("LIS2DE12 INT1_SRC: Z high event has occurred\r\n");
        //         }
        //     }

            // int32_t next_task_time_tmp = ( int32_t ) ( task_manager.modem_task[STACK_ID].time_to_execute_s - smtc_modem_hal_get_time_in_s( ) );


            // check lorawan_api_next_join_time_second_get( ) to avoid joining the network too often
            
        // }

        // uint32_t time_to = modem_supervisor_get_task( )->time_to_execute_s;

        // uint32_t time_to = ( modem_supervisor_get_task( ) )->modem_task[STACK_ID].time_to_execute_s;

        // stask_manager* context  = modem_supervisor_get_task( );
        // // get the time to execute the next task
        // uint32_t time_to = context->modem_task[STACK_ID].time_to_execute_s;

        // SMTC_HAL_TRACE_INFO("time_to: %d\r\n", gettimeBeforeNextTask(2));

        // lorawan_join_management_get_stack_id

        

        // uint8_t lorawan_join_stack_id = lorawan_join_management_get_stack_id();
        // if (lorawan_join_stack_id != -1) {
        //     SMTC_HAL_TRACE_INFO("Lorawan join stack id: %u \r\n", lorawan_join_stack_id);
        //     int8_t time_before_lorawan_join = gettimeBeforeNextTask(lorawan_join_stack_id);

        //     SMTC_HAL_TRACE_INFO("Time before next join: %d\r\n", time_before_lorawan_join);

        //     if (time_before_lorawan_join <= 0) {
        //         lorawan_join_management_clear_stack_id();
        //     }
        // } else {
        //     lorawan_join_management_clear_stack_id();
        // }

        // SMTC_HAL_TRACE_INFO("Time before next join: %d\r\n", lorawan_api_next_join_time_second_get());

        // uint32_t remaining_time_in_s = 0;

        // smtc_modem_alarm_get_remaining_time( &remaining_time_in_s );
        // SMTC_HAL_TRACE_INFO("Remaining time in s: %d\r\n", remaining_time_in_s);

        

        
        // checkBatteryStatus();



        //SMTC_HAL_TRACE_INFO("get_hall_effect1_irq_state: %d \r\n", get_hall_effect1_irq_state());
        //SMTC_HAL_TRACE_INFO("get_hall_effect2_irq_state: %d \r\n", get_hall_effect2_irq_state());
        


        // Modem process launch
        sleep_time_ms = smtc_modem_run_engine( );

        // Atomically check sleep conditions
        hal_mcu_disable_irq( );
        if( smtc_modem_is_irq_flag_pending( ) == false ) {

            hal_watchdog_reload( );
            hal_mcu_set_sleep_for_ms( MIN( sleep_time_ms, WATCHDOG_RELOAD_PERIOD_MS ) );
        }
        hal_watchdog_reload( );
        hal_mcu_enable_irq( );
    }
}

