MagnusErler/WiFiLocationTracker/stm32/geolocation/main_geolocation/main_geolocation.c
/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITION --------------------------------------------
 */

void setupWiFi(uint8_t stack_id) {
    smtc_modem_wifi_send_mode( stack_id, SMTC_MODEM_SEND_MODE_UPLINK );
    /* Program Wi-Fi scan */
    smtc_modem_wifi_scan( stack_id, 0 );
}

void setupGNSS(uint8_t stack_id) {
    /* Start almanac demodulation service */
    smtc_modem_almanac_demodulation_set_constellations( stack_id, SMTC_MODEM_GNSS_CONSTELLATION_GPS_BEIDOU );
    smtc_modem_almanac_demodulation_start( stack_id );

    smtc_modem_gnss_send_mode( stack_id, SMTC_MODEM_SEND_MODE_STORE_AND_FORWARD );
    /* Program GNSS scan */
    smtc_modem_gnss_set_constellations( stack_id, SMTC_MODEM_GNSS_CONSTELLATION_GPS_BEIDOU );
    smtc_modem_gnss_scan( stack_id, SMTC_MODEM_GNSS_MODE_MOBILE, 0 );
}

float getTemperature() {
    // SMTC_HAL_TRACE_INFO("LIS2DE12 Temperature: %d\r\n", acc_get_temperature( ));
    uint16_t temp_10_0;
    lr11xx_system_get_temp( NULL, &temp_10_0 );
    const float temperature = 25 + (1000/(-1.7)) * ((temp_10_0/2047.0) * 1.35 - 0.7295);
    SMTC_HAL_TRACE_INFO("%d.%d °C\r\n", (uint8_t)temperature, (uint8_t)((temperature - (uint8_t)temperature) * 100));
    if ((uint8_t)temperature > 50) {
        SMTC_HAL_TRACE_INFO("LR1110 temperature is too high. TCXO mode may not be set up correctly\r\n");
        return 0;
    }
    return temperature;
}

float getBatteryVoltage() {
    uint8_t vbat;
    lr11xx_system_get_vbat( NULL, &vbat );
    const float batteryVoltage = (((5 * vbat)/255.0) - 1) * 1.35;
    if (batteryVoltage > 3.4) {
        SMTC_HAL_TRACE_INFO("Battery voltage is above 3.4 V. Something seems wrong\r\n");
        return 0;
    }

    // 0% <---> below 1.7 V
    // 100% <---> above 3.7 V
    // convert battery voltage to a percentage
    // int8_t batteryVoltage_percentage = (batteryVoltage - 1.7) / 2.0 * 100;

    // SMTC_HAL_TRACE_INFO("%d.%d V\r\n", (uint8_t)batteryVoltage, (uint8_t)((batteryVoltage - (uint8_t)batteryVoltage) * 100));
    return batteryVoltage;
}

void checkBatteryStatus() {
    float batteryVoltage = getBatteryVoltage();
    if (batteryVoltage < 3.0) {
        SMTC_HAL_TRACE_INFO("Battery voltage is below 3.0 V\r\n");

        uint8_t low_battery_warning[1] = { 0x00 };
        low_battery_warning[0] = batteryVoltage * 70;
        smtc_modem_request_uplink( STACK_ID, 3, false, low_battery_warning, 1 );
    }

}

/**
 * @brief User callback for modem event
 *
 *  This callback is called every time an event ( see smtc_modem_event_t ) appears in the modem.
 *  Several events may have to be read from the modem when this callback is called.
 */
static void modem_event_callback( void ) {
    SMTC_HAL_TRACE_MSG_COLOR( "get_event () callback\r\n", HAL_DBG_TRACE_COLOR_BLUE );

    smtc_modem_event_t                                          current_event;
    uint8_t                                                     event_pending_count;
    uint8_t                                                     stack_id = STACK_ID;
    smtc_modem_gnss_event_data_scan_done_t                      scan_done_data;
    smtc_modem_gnss_event_data_terminated_t                     terminated_data;
    smtc_modem_almanac_demodulation_event_data_almanac_update_t almanac_update_data;
    smtc_modem_wifi_event_data_scan_done_t                      wifi_scan_done_data;
    smtc_modem_wifi_event_data_terminated_t                     wifi_terminated_data;

    // Continue to read modem event until all event has been processed
    do {
        // Read modem event
        smtc_modem_get_event( &current_event, &event_pending_count );

        switch( current_event.event_type ) {
        case SMTC_MODEM_EVENT_RESET:
            SMTC_HAL_TRACE_INFO( "Event received: RESET\r\n" );

            // Get internal credentials
            smtc_modem_get_joineui( stack_id, join_eui );
            SMTC_HAL_TRACE_ARRAY( "JOIN_EUI", join_eui, SMTC_MODEM_EUI_LENGTH );
            smtc_modem_get_chip_eui( stack_id, chip_eui );
            SMTC_HAL_TRACE_ARRAY( "CHIP_EUI", chip_eui, SMTC_MODEM_EUI_LENGTH );
            smtc_modem_get_pin( stack_id, pin );
            SMTC_HAL_TRACE_ARRAY( "PIN", pin, SMTC_MODEM_PIN_LENGTH );

            /* Set user region */
            smtc_modem_set_region( stack_id, MODEM_EXAMPLE_REGION );
            /* Schedule a Join LoRaWAN network */
            smtc_modem_join_network( stack_id );

            /* Set GNSS and Wi-Fi send mode */
            smtc_modem_store_and_forward_flash_clear_data( stack_id );
            smtc_modem_store_and_forward_set_state( stack_id, SMTC_MODEM_STORE_AND_FORWARD_ENABLE );
            
            switch (1) {
            case 1:
                // WiFi scan first, then GNSS scan
                setupWiFi( stack_id );
                // setupGNSS( stack_id );
                break;
            case 2:
                setupGNSS( stack_id );
                setupWiFi( stack_id );
                break;
            default:
                break;
            }
            
            /* Notify user with leds */
            smtc_board_led_set( smtc_board_get_led_tx_mask( ), true );
            break;

        case SMTC_MODEM_EVENT_ALARM:
            SMTC_HAL_TRACE_INFO( "Event received: ALARM\r\n" );

            keep_alive_payload[0] = getTemperature() / 5.0;
            keep_alive_payload[1] = getBatteryVoltage() * 70;

            smtc_modem_request_uplink( stack_id, KEEP_ALIVE_PORT, false, keep_alive_payload, KEEP_ALIVE_SIZE );
            smtc_modem_alarm_start_timer( KEEP_ALIVE_PERIOD_S );
            break;

        case SMTC_MODEM_EVENT_JOINED:
            SMTC_HAL_TRACE_INFO( "Event received: JOINED\r\n" );
            /* Notify user with leds */
            smtc_board_led_set( smtc_board_get_led_tx_mask( ), false );
            smtc_board_led_pulse( smtc_board_get_led_rx_mask( ), true, LED_PERIOD_MS );
            /* Set custom ADR profile for geolocation */
            smtc_modem_adr_set_profile( stack_id, SMTC_MODEM_ADR_PROFILE_CUSTOM, adr_custom_list );
            smtc_modem_set_nb_trans( stack_id, custom_nb_trans );
            /* Start time for regular uplink */
            smtc_modem_alarm_start_timer( KEEP_ALIVE_PERIOD_S );

            if (restart_occured) {
                uint8_t join_accept_payload[2] = { 0x00 };
                join_accept_payload[0] = getTemperature() / 5.0;
                join_accept_payload[1] = getBatteryVoltage() * 70;
                smtc_modem_request_uplink( stack_id, 10, false, join_accept_payload, 2 );
                restart_occured = false;
            }
            
            break;

        case SMTC_MODEM_EVENT_TXDONE:
            SMTC_HAL_TRACE_INFO( "Event received: TXDONE (%d)\r\n", current_event.event_data.txdone.status );
            SMTC_HAL_TRACE_INFO( "Transmission done\r\n" );
            break;

        case SMTC_MODEM_EVENT_DOWNDATA:
            SMTC_HAL_TRACE_INFO( "Event received: DOWNDATA\r\n" );
            // Get downlink data

            // reset rx_payload
            memset( rx_payload, 0, SMTC_MODEM_MAX_LORAWAN_PAYLOAD_LENGTH );
            smtc_modem_get_downlink_data( rx_payload, &rx_payload_size, &rx_metadata, &rx_remaining );
            SMTC_HAL_TRACE_PRINTF( "Data received on port %u\r\n", rx_metadata.fport );
            SMTC_HAL_TRACE_ARRAY( "Received payload", rx_payload, rx_payload_size );


            uint8_t custom_payload[2] = { 0x00 };

            switch (rx_metadata.fport) {
            case 1:

