MagnusErler/WiFiLocationTracker/stm32/geolocation/main_geolocation/main_geolocation.c
                if (rx_payload_size == 1) {
                    SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", rx_payload[0]);
                    GEOLOCATION_WIFI_SCAN_PERIOD_S = rx_payload[0];
                } else if (rx_payload_size == 2) {
                    SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", (rx_payload[0] << 8) + rx_payload[1]);
                    GEOLOCATION_WIFI_SCAN_PERIOD_S = (rx_payload[0] << 8) + rx_payload[1];
                }

                SMTC_HAL_TRACE_PRINTF("Setting new Wi-Fi scan period to %u s\r\n", GEOLOCATION_WIFI_SCAN_PERIOD_S);

                // cancel the current Wi-Fi scan (not possible if the scan has already started)
                smtc_modem_wifi_scan_cancel( stack_id );
                // set the new Wi-Fi scan period
                smtc_modem_wifi_scan( stack_id, GEOLOCATION_WIFI_SCAN_PERIOD_S );


                // // smtc_modem_request_uplink( stack_id, 1, false, keep_alive_payload, KEEP_ALIVE_SIZE );
                // uint8_t custom_payload[4] = { 0x00 };
                // custom_payload[0] = 0xAB;
                // custom_payload[1] = 0xCD;
                // smtc_modem_request_uplink( stack_id, 15, false, custom_payload, 4 );
                // smtc_modem_alarm_start_timer( KEEP_ALIVE_PERIOD_S );
                break;
            case 2:

                if (rx_payload_size == 1) {
                    SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", rx_payload[0]);
                    GEOLOCATION_GNSS_SCAN_PERIOD_S = rx_payload[0];
                } else if (rx_payload_size == 2) {
                    SMTC_HAL_TRACE_PRINTF( "payload in dec: %u\r\n", (rx_payload[0] << 8) + rx_payload[1]);
                    GEOLOCATION_GNSS_SCAN_PERIOD_S = (rx_payload[0] << 8) + rx_payload[1];
                }

                SMTC_HAL_TRACE_PRINTF("Setting new GNSS scan period to %u s\r\n", GEOLOCATION_GNSS_SCAN_PERIOD_S);

                // cancel the current GNSS scan (not possible if the scan has already started)
                // This is maybe already done inside modem_supervisor_add_task(), but just to be one the safe side we do it here again
                smtc_modem_gnss_scan_cancel( stack_id );
                // set the new GNSS scan period
                smtc_modem_gnss_scan( stack_id, SMTC_MODEM_GNSS_MODE_MOBILE, GEOLOCATION_GNSS_SCAN_PERIOD_S );
                break;
            case 3:              
                // smtc_modem_request_uplink( stack_id, 1, false, keep_alive_payload, KEEP_ALIVE_SIZE );
                custom_payload[0] = getTemperature() / 5.0;
                custom_payload[1] = getBatteryVoltage() * 70;
                smtc_modem_request_uplink( stack_id, 15, false, custom_payload, 4 );
                smtc_modem_alarm_start_timer( KEEP_ALIVE_PERIOD_S );

                break;
            default:
                break;
            }

            break;

        case SMTC_MODEM_EVENT_JOINFAIL:
            SMTC_HAL_TRACE_INFO( "Event received: JOINFAIL\r\n" );
            SMTC_HAL_TRACE_WARNING( "Join request failed\r\n" );
            break;

        case SMTC_MODEM_EVENT_ALCSYNC_TIME:
            SMTC_HAL_TRACE_INFO( "Event received: TIME\r\n" );
            break;

        case SMTC_MODEM_EVENT_GNSS_SCAN_DONE:
            SMTC_HAL_TRACE_INFO( "Event received: GNSS_SCAN_DONE\r\n" );
            /* Get event data */
            smtc_modem_gnss_get_event_data_scan_done( stack_id, &scan_done_data );
            break;

        case SMTC_MODEM_EVENT_GNSS_TERMINATED:
            SMTC_HAL_TRACE_INFO( "Event received: GNSS_TERMINATED\r\n" );
            /* Notify user with leds */
            smtc_board_led_pulse( smtc_board_get_led_tx_mask( ), true, LED_PERIOD_MS );
            /* Get event data */
            smtc_modem_gnss_get_event_data_terminated( stack_id, &terminated_data );
            /* launch next scan */
            smtc_modem_gnss_scan( stack_id, SMTC_MODEM_GNSS_MODE_MOBILE, GEOLOCATION_GNSS_SCAN_PERIOD_S );
            break;

        case SMTC_MODEM_EVENT_GNSS_ALMANAC_DEMOD_UPDATE:
            SMTC_HAL_TRACE_INFO( "Event received: GNSS_ALMANAC_DEMOD_UPDATE\r\n" );
            smtc_modem_almanac_demodulation_get_event_data_almanac_update( stack_id, &almanac_update_data );
            /* Store progress in keep alive payload */
            // keep_alive_payload[0] = almanac_update_data.update_progress_gps;
            // keep_alive_payload[1] = almanac_update_data.update_progress_beidou;
            SMTC_HAL_TRACE_PRINTF( "GPS progress: %u%%\r\n", almanac_update_data.update_progress_gps );
            SMTC_HAL_TRACE_PRINTF( "BDS progress: %u%%\r\n", almanac_update_data.update_progress_beidou );
            SMTC_HAL_TRACE_PRINTF( "aborted: %u\r\n", almanac_update_data.stat_nb_aborted_by_rp );
            break;

        case SMTC_MODEM_EVENT_SET_DEBUG_PIN:
            hal_gpio_set_value( DEBUG_PIN, 1 );
            SMTC_HAL_TRACE_INFO( "Event received: SET DEBUG PIN\r\n" );
            break;
        
        case SMTC_MODEM_EVENT_WIFI_SCAN_DONE:
            hal_gpio_set_value( DEBUG_PIN, 0 );
            SMTC_HAL_TRACE_INFO( "Event received: WIFI_SCAN_DONE\r\n" );
            /* Get event data */
            smtc_modem_wifi_get_event_data_scan_done( stack_id, &wifi_scan_done_data );
            break;

        case SMTC_MODEM_EVENT_WIFI_TERMINATED:
            SMTC_HAL_TRACE_INFO( "Event received: WIFI_TERMINATED\r\n" );

            /*custom_payload[0] = getTemperature() / 5.0;
            custom_payload[1] = getBatteryVoltage() * 70;
            smtc_modem_request_uplink( stack_id, 15, false, custom_payload, 4 );
            smtc_modem_alarm_start_timer( KEEP_ALIVE_PERIOD_S );*/


            /* Notify user with leds */
            smtc_board_led_pulse( smtc_board_get_led_tx_mask( ), true, LED_PERIOD_MS );
            /* Get event data */
            smtc_modem_wifi_get_event_data_terminated( stack_id, &wifi_terminated_data );
            /* launch next scan */
            smtc_modem_wifi_scan( stack_id, GEOLOCATION_WIFI_SCAN_PERIOD_S );
            break;

        case SMTC_MODEM_EVENT_LINK_CHECK:
            SMTC_HAL_TRACE_INFO( "Event received: LINK_CHECK\r\n" );
            break;

        case SMTC_MODEM_EVENT_CLASS_B_STATUS:
            SMTC_HAL_TRACE_INFO( "Event received: CLASS_B_STATUS\r\n" );
            break;

        default:
            SMTC_HAL_TRACE_ERROR( "Unknown event %u\r\n", current_event.event_type );
            break;
        }
    } while( event_pending_count > 0 );
}

/* --- EOF ------------------------------------------------------------------ */
